In [1]:
import pandas as pd

In [3]:
dataset = pd.read_csv("F://JUPYTER-CODE//Machine-Learning-and-AI-Basics//datasheet.csv")
dataset

     Name  Age    Language
0     Raj   20      Python
1   Alice   19        Java
2     Sky   21           C
3   Shawn   25  Javascript
4    Shaw   25  Javascript
5    Shan   26  Javascript
6    Shwn   29  Javascript
7   Shawn  215  Javascript
8    Shwn   25  Javascript
9   Shawn   25  Javascript
10  Shawn   25  Javascript

In [4]:
# If theres a null or NA value show it by
dataset = pd.read_csv("F://JUPYTER-CODE//Machine-Learning-and-AI-Basics//datasheet.csv")
dataset

     Name  Age    Language
0     Raj   20      Python
1   Alice   19        Java
2     Sky   21           C
3   Shawn   25  Javascript
4    Shaw   25         NaN
5    Shan   26         NaN
6    Shwn   29  Javascript
7   Shawn  215         NaN
8    Shwn   25  Javascript
9   Shawn   25  Javascript
10  Shawn   25  Javascript

In [7]:
# If any other value except blanks in CSV
# eg - Not ava
dataset = pd.read_csv("F://JUPYTER-CODE//Machine-Learning-and-AI-Basics//datasheet.csv",na_values="Not ava")
dataset

     Name  Age    Language
0     Raj   20      Python
1   Alice   19        Java
2     Sky   21           C
3   Shawn   25  Javascript
4    Shaw   25         NaN
5    Shan   26         NaN
6    Shwn   29  Javascript
7   Shawn  215         NaN
8    Shwn   25  Javascript
9   Shawn   25  Javascript
10  Shawn   25  Javascript